In [1]:
import pandas as pd

In [6]:
record1 = pd.Series({'Name': 'Alice',
                    'Class': 'Physics',
                    'Score': 85})
record2 = pd.Series({'Name': 'Jack',
                    'Class': 'Chemistry',
                    'Score': 80})
record3 = pd.Series({'Name': 'Helen',
                    'Class': 'Biology',
                    'Score': 90})

In [9]:
df=pd.DataFrame([record1, record2, record3],
               index = ['school1', 'school2', 'school3'])

df.head()#first couple of data in both axle

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     80
school3  Helen    Biology     90

In [22]:
#by list of dic
students = [{'Name': 'Alice',
             'Class': 'Physics',
             'Score': 85},
            {'Name': 'Jack',
             'Class': 'Chemistry',
             'Score': 80},
            {'Name': 'Helen',
             'Class': 'Biology',
             'Score': 90}]

df = pd.DataFrame(students, index = ['school1', 'school2', 'school1'])
df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     80
school1  Helen    Biology     90

In [16]:
df.loc['school2'] # index name is included in the output

Name          Jack
Class    Chemistry
Score           80
Name: school2, dtype: object

In [17]:
type(df.loc['school2'])

pandas.core.series.Series

In [25]:
df.loc['school1']

          Name    Class  Score
school1  Alice  Physics     85
school1  Helen  Biology     90

In [26]:
type(df.loc['school1'])

pandas.core.frame.DataFrame

In [29]:
df.loc['school1', 'Name']

school1    Alice
school1    Helen
Name: Name, dtype: object

chose one column

In [30]:
#method1
df.T #transpose column and row

       school1    school2  school1
Name     Alice       Jack    Helen
Class  Physics  Chemistry  Biology
Score       85         80       90

In [31]:
df.T.loc['Name']

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object

In [33]:
#method2
df['Name'] #df[] for column; df.iloc[] df.loc[] for row

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object

In [41]:
type(df['Name'])

pandas.core.series.Series

In [42]:
df.loc['school1']['Name']

school1    Alice
school1    Helen
Name: Name, dtype: object

In [43]:
print(type(df.loc['school1']))
print(type(df.loc['school1']['Name']))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [44]:
#Chaing: copy dataframe: best avoided if other approach

In [45]:
df.loc[:,['Name', 'Score']]

          Name  Score
school1  Alice     85
school2   Jack     80
school1  Helen     90

In [46]:
#droping data dosent drop by default, actually copy-drop

In [47]:
df.drop('school1')

         Name      Class  Score
school2  Jack  Chemistry     80

In [48]:
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     80
school1  Helen    Biology     90

In [50]:
#method 1 drop column from the origianl df
copy_df = df.copy()
copy_df.drop('Name', inplace = True, axis =1)
copy_df

             Class  Score
school1    Physics     85
school2  Chemistry     80
school1    Biology     90

In [51]:
#Method 2 to drop column
del copy_df['Class']
copy_df

         Score
school1     85
school2     80
school1     90

In [52]:
#add 
df['ClassRanking'] = None
df

          Name      Class  Score ClassRanking
school1  Alice    Physics     85         None
school2   Jack  Chemistry     80         None
school1  Helen    Biology     90         None